https://Daniellem97.app.spacelift.io/stack/debugtest/run/01JWM7SJ1BYN33AK2D5X2Z29D8 has finished

## Planning logs

```
[01JV7FBMZS94V7V7JD7G28V27B] Planning changes with 0 custom hooks...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c spacelift-worker env >> /mnt/workspace/.env_hooks_before && tofu plan -input=false -lock=false -out=spacelift.plan && spacelift-worker env >> /mnt/workspace/.env_hooks_after]
data.terraform_remote_state.demo-stack-state: Reading...
data.terraform_remote_state.demo-stack-state: Read complete after 0s
module.kms.data.aws_partition.current[0]: Reading...
module.kms.data.aws_caller_identity.current[0]: Reading...
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-0c3261a70311f6cae]
module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=872025319814]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4087627824]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-03131412a64293059]
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-0efdeb51db503c285]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-05a55ca6b47ed5494]
aws_security_group.mtc_sg: Refreshing state... [id=sg-082069860a02ef64a]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-087dc9abf587278d1]
aws_route.default_route2: Refreshing state... [id=r-rtb-0efdeb51db503c2851080289494]
aws_route.default_route: Refreshing state... [id=r-rtb-0efdeb51db503c2851080289494]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.kms.aws_kms_grant.this["lambda"] will be created
  + resource "aws_kms_grant" "this" {
      + grant_id          = (known after apply)
      + grant_token       = (known after apply)
      + grantee_principal = "arn:aws:iam::012345678901:role/lambda-function"
      + id                = (known after apply)
      + key_id            = (known after apply)
      + name              = "lambda"
      + operations        = [
          + "Decrypt",
          + "Encrypt",
          + "GenerateDataKey",
        ]
      + retire_on_delete  = false

      + constraints {
          + encryption_context_equals = {
              + "Department" = "Finance"
            }
        }
    }

  # module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Complete key example showing various configurations available"
      + enable_key_rotation                = *****
      + id                                 = (known after apply)
      + is_enabled                         = *****
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::872025319814:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Default"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/owner"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyOwner"
                    },
                  + {
                      + Action    = [
                          + "kms:Update*",
                          + "kms:UntagResource",
                          + "kms:TagResource",
                          + "kms:ScheduleKeyDeletion",
                          + "kms:Revoke*",
                          + "kms:ReplicateKey",
                          + "kms:Put*",
                          + "kms:List*",
                          + "kms:ImportKeyMaterial",
                          + "kms:Get*",
                          + "kms:Enable*",
                          + "kms:Disable*",
                          + "kms:Describe*",
                          + "kms:Delete*",
                          + "kms:Create*",
                          + "kms:CancelKeyDeletion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/admin"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAdministration"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyUsage"
                    },
                  + {
                      + Action    = [
                          + "kms:RevokeGrant",
                          + "kms:ListGrants",
                          + "kms:CreateGrant",
                        ]
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "*****"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/ec2-role"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyServiceUsage"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/symmetric-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeySymmetricEncryption"
                    },
                  + {
                      + Action    = [
                          + "kms:VerifyMac",
                          + "kms:GenerateMac",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/hmac-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyHMAC"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GetPublicKey",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/asymmetric-public-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAsymmetricPublicEncryption"
                    },
                  + {
                      + Action    = [
                          + "kms:Verify",
                          + "kms:Sign",
                          + "kms:GetPublicKey",
                          + "kms:DescribeKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::012345678901:role/sign-verify-user"
                        }
                      + Resource  = "*"
                      + Sid       = "KeyAsymmetricSignVerify"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "Terraform"   = "*****"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "Terraform"   = "*****"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

[01JV7FBMZS94V7V7JD7G28V27B] Changes are GO
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json]
Failed to marshal state to json: unsupported attribute "enable_classiclink"
[01JV7FBMZS94V7V7JD7G28V27B] unexpected exit code when running show command: 1
[01JV7FBMZS94V7V7JD7G28V27B] Uploading the list of managed resources...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json "spacelift.plan"]
[01JV7FBMZS94V7V7JD7G28V27B] Generating Infracost JSON report from plan
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path /tmp/spacelift-plan4124600195 --format=json --log-level=warn]

[01JV7FBMZS94V7V7JD7G28V27B] Infracost report generated successfully
[01JV7FBMZS94V7V7JD7G28V27B] Mapping Infracost data to resources
[01JV7FBMZS94V7V7JD7G28V27B] Costs mapped successfully
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu output -json]
[01JV7FBMZS94V7V7JD7G28V27B] Please be aware that the run changes calculation includes output changes.
[01JV7FBMZS94V7V7JD7G28V27B] Resource list upload is GO
[01JV7FBMZS94V7V7JD7G28V27B] Generating JSON representation of the plan...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json "spacelift.plan"]
[01JV7FBMZS94V7V7JD7G28V27B] JSON representation is GO
[01JV7FBMZS94V7V7JD7G28V27B] Generating Infracost JSON report from plan
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path spacelift.plan.json --format=json --log-level=warn]

[01JV7FBMZS94V7V7JD7G28V27B] Infracost report generated successfully
[01JV7FBMZS94V7V7JD7G28V27B] Loading custom plan policy inputs...
[01JV7FBMZS94V7V7JD7G28V27B] 0 custom plan policy inputs found
[01JV7FBMZS94V7V7JD7G28V27B] Evaluated 3 plan policies
[01JV7FBMZS94V7V7JD7G28V27B] Plan checks are GO
```
